NordicSemiconductor/nrfx/mdk/nrf54l09_enga_global.h
#define NRF_FICR_NS                       ((NRF_FICR_Type*)                     NRF_FICR_NS_BASE)
#define NRF_UICR_S                        ((NRF_UICR_Type*)                     NRF_UICR_S_BASE)
#define NRF_SICR_S                        ((NRF_SICR_Type*)                     NRF_SICR_S_BASE)
#define NRF_CRACENCORE_S                  ((NRF_CRACENCORE_Type*)               NRF_CRACENCORE_S_BASE)
#define NRF_SPU00_S                       ((NRF_SPU_Type*)                      NRF_SPU00_S_BASE)
#define NRF_MPC00_S                       ((NRF_MPC_Type*)                      NRF_MPC00_S_BASE)
#define NRF_DPPIC00_NS                    ((NRF_DPPIC_Type*)                    NRF_DPPIC00_NS_BASE)
#define NRF_DPPIC00_S                     ((NRF_DPPIC_Type*)                    NRF_DPPIC00_S_BASE)
#define NRF_PPIB00_NS                     ((NRF_PPIB_Type*)                     NRF_PPIB00_NS_BASE)
#define NRF_PPIB00_S                      ((NRF_PPIB_Type*)                     NRF_PPIB00_S_BASE)
#define NRF_PPIB01_NS                     ((NRF_PPIB_Type*)                     NRF_PPIB01_NS_BASE)
#define NRF_PPIB01_S                      ((NRF_PPIB_Type*)                     NRF_PPIB01_S_BASE)
#define NRF_KMU_S                         ((NRF_KMU_Type*)                      NRF_KMU_S_BASE)
#define NRF_AAR00_NS                      ((NRF_AAR_Type*)                      NRF_AAR00_NS_BASE)
#define NRF_CCM00_NS                      ((NRF_CCM_Type*)                      NRF_CCM00_NS_BASE)
#define NRF_AAR00_S                       ((NRF_AAR_Type*)                      NRF_AAR00_S_BASE)
#define NRF_CCM00_S                       ((NRF_CCM_Type*)                      NRF_CCM00_S_BASE)
#define NRF_ECB00_NS                      ((NRF_ECB_Type*)                      NRF_ECB00_NS_BASE)
#define NRF_ECB00_S                       ((NRF_ECB_Type*)                      NRF_ECB00_S_BASE)
#define NRF_VPR00_NS                      ((NRF_VPR_Type*)                      NRF_VPR00_NS_BASE)
#define NRF_VPR00_S                       ((NRF_VPR_Type*)                      NRF_VPR00_S_BASE)
#define NRF_GLITCHDET_S                   ((NRF_GLITCHDET_Type*)                NRF_GLITCHDET_S_BASE)
#define NRF_RRAMC_S                       ((NRF_RRAMC_Type*)                    NRF_RRAMC_S_BASE)
#define NRF_CTRLAP_NS                     ((NRF_CTRLAPPERI_Type*)               NRF_CTRLAP_NS_BASE)
#define NRF_CTRLAP_S                      ((NRF_CTRLAPPERI_Type*)               NRF_CTRLAP_S_BASE)
#define NRF_TAD_NS                        ((NRF_TAD_Type*)                      NRF_TAD_NS_BASE)
#define NRF_TAD_S                         ((NRF_TAD_Type*)                      NRF_TAD_S_BASE)
#define NRF_TIMER00_NS                    ((NRF_TIMER_Type*)                    NRF_TIMER00_NS_BASE)
#define NRF_TIMER00_S                     ((NRF_TIMER_Type*)                    NRF_TIMER00_S_BASE)
#define NRF_EGU00_NS                      ((NRF_EGU_Type*)                      NRF_EGU00_NS_BASE)
#define NRF_EGU00_S                       ((NRF_EGU_Type*)                      NRF_EGU00_S_BASE)
#define NRF_CRACEN_S                      ((NRF_CRACEN_Type*)                   NRF_CRACEN_S_BASE)
#define NRF_SPU10_S                       ((NRF_SPU_Type*)                      NRF_SPU10_S_BASE)
#define NRF_DPPIC10_NS                    ((NRF_DPPIC_Type*)                    NRF_DPPIC10_NS_BASE)
#define NRF_DPPIC10_S                     ((NRF_DPPIC_Type*)                    NRF_DPPIC10_S_BASE)
#define NRF_PPIB10_NS                     ((NRF_PPIB_Type*)                     NRF_PPIB10_NS_BASE)
#define NRF_PPIB10_S                      ((NRF_PPIB_Type*)                     NRF_PPIB10_S_BASE)
#define NRF_PPIB11_NS                     ((NRF_PPIB_Type*)                     NRF_PPIB11_NS_BASE)
#define NRF_PPIB11_S                      ((NRF_PPIB_Type*)                     NRF_PPIB11_S_BASE)
#define NRF_TIMER10_NS                    ((NRF_TIMER_Type*)                    NRF_TIMER10_NS_BASE)
#define NRF_TIMER10_S                     ((NRF_TIMER_Type*)                    NRF_TIMER10_S_BASE)
#define NRF_EGU10_NS                      ((NRF_EGU_Type*)                      NRF_EGU10_NS_BASE)
#define NRF_EGU10_S                       ((NRF_EGU_Type*)                      NRF_EGU10_S_BASE)
#define NRF_RADIO_NS                      ((NRF_RADIO_Type*)                    NRF_RADIO_NS_BASE)
#define NRF_RADIO_S                       ((NRF_RADIO_Type*)                    NRF_RADIO_S_BASE)
#define NRF_SPU20_S                       ((NRF_SPU_Type*)                      NRF_SPU20_S_BASE)
#define NRF_DPPIC20_NS                    ((NRF_DPPIC_Type*)                    NRF_DPPIC20_NS_BASE)
#define NRF_DPPIC20_S                     ((NRF_DPPIC_Type*)                    NRF_DPPIC20_S_BASE)
#define NRF_PPIB20_NS                     ((NRF_PPIB_Type*)                     NRF_PPIB20_NS_BASE)
#define NRF_PPIB20_S                      ((NRF_PPIB_Type*)                     NRF_PPIB20_S_BASE)
#define NRF_PPIB21_NS                     ((NRF_PPIB_Type*)                     NRF_PPIB21_NS_BASE)
#define NRF_PPIB21_S                      ((NRF_PPIB_Type*)                     NRF_PPIB21_S_BASE)
#define NRF_PPIB22_NS                     ((NRF_PPIB_Type*)                     NRF_PPIB22_NS_BASE)
#define NRF_PPIB22_S                      ((NRF_PPIB_Type*)                     NRF_PPIB22_S_BASE)
#define NRF_SPIM20_NS                     ((NRF_SPIM_Type*)                     NRF_SPIM20_NS_BASE)
#define NRF_SPIS20_NS                     ((NRF_SPIS_Type*)                     NRF_SPIS20_NS_BASE)
#define NRF_TWIM20_NS                     ((NRF_TWIM_Type*)                     NRF_TWIM20_NS_BASE)
#define NRF_TWIS20_NS                     ((NRF_TWIS_Type*)                     NRF_TWIS20_NS_BASE)
#define NRF_UARTE20_NS                    ((NRF_UARTE_Type*)                    NRF_UARTE20_NS_BASE)
#define NRF_SPIM20_S                      ((NRF_SPIM_Type*)                     NRF_SPIM20_S_BASE)
#define NRF_SPIS20_S                      ((NRF_SPIS_Type*)                     NRF_SPIS20_S_BASE)
#define NRF_TWIM20_S                      ((NRF_TWIM_Type*)                     NRF_TWIM20_S_BASE)
#define NRF_TWIS20_S                      ((NRF_TWIS_Type*)                     NRF_TWIS20_S_BASE)
#define NRF_UARTE20_S                     ((NRF_UARTE_Type*)                    NRF_UARTE20_S_BASE)
#define NRF_SPIM21_NS                     ((NRF_SPIM_Type*)                     NRF_SPIM21_NS_BASE)
#define NRF_SPIS21_NS                     ((NRF_SPIS_Type*)                     NRF_SPIS21_NS_BASE)
#define NRF_TWIM21_NS                     ((NRF_TWIM_Type*)                     NRF_TWIM21_NS_BASE)
#define NRF_TWIS21_NS                     ((NRF_TWIS_Type*)                     NRF_TWIS21_NS_BASE)
#define NRF_UARTE21_NS                    ((NRF_UARTE_Type*)                    NRF_UARTE21_NS_BASE)
#define NRF_SPIM21_S                      ((NRF_SPIM_Type*)                     NRF_SPIM21_S_BASE)
#define NRF_SPIS21_S                      ((NRF_SPIS_Type*)                     NRF_SPIS21_S_BASE)
#define NRF_TWIM21_S                      ((NRF_TWIM_Type*)                     NRF_TWIM21_S_BASE)
#define NRF_TWIS21_S                      ((NRF_TWIS_Type*)                     NRF_TWIS21_S_BASE)
#define NRF_UARTE21_S                     ((NRF_UARTE_Type*)                    NRF_UARTE21_S_BASE)
#define NRF_EGU20_NS                      ((NRF_EGU_Type*)                      NRF_EGU20_NS_BASE)
#define NRF_EGU20_S                       ((NRF_EGU_Type*)                      NRF_EGU20_S_BASE)
#define NRF_TIMER20_NS                    ((NRF_TIMER_Type*)                    NRF_TIMER20_NS_BASE)
#define NRF_TIMER20_S                     ((NRF_TIMER_Type*)                    NRF_TIMER20_S_BASE)
#define NRF_TIMER21_NS                    ((NRF_TIMER_Type*)                    NRF_TIMER21_NS_BASE)
#define NRF_TIMER21_S                     ((NRF_TIMER_Type*)                    NRF_TIMER21_S_BASE)
#define NRF_TIMER22_NS                    ((NRF_TIMER_Type*)                    NRF_TIMER22_NS_BASE)
#define NRF_TIMER22_S                     ((NRF_TIMER_Type*)                    NRF_TIMER22_S_BASE)
#define NRF_TIMER23_NS                    ((NRF_TIMER_Type*)                    NRF_TIMER23_NS_BASE)
#define NRF_TIMER23_S                     ((NRF_TIMER_Type*)                    NRF_TIMER23_S_BASE)
#define NRF_TIMER24_NS                    ((NRF_TIMER_Type*)                    NRF_TIMER24_NS_BASE)
#define NRF_TIMER24_S                     ((NRF_TIMER_Type*)                    NRF_TIMER24_S_BASE)
#define NRF_MEMCONF_NS                    ((NRF_MEMCONF_Type*)                  NRF_MEMCONF_NS_BASE)
#define NRF_MEMCONF_S                     ((NRF_MEMCONF_Type*)                  NRF_MEMCONF_S_BASE)
#define NRF_SAADC_NS                      ((NRF_SAADC_Type*)                    NRF_SAADC_NS_BASE)
#define NRF_SAADC_S                       ((NRF_SAADC_Type*)                    NRF_SAADC_S_BASE)
#define NRF_TEMP_NS                       ((NRF_TEMP_Type*)                     NRF_TEMP_NS_BASE)
#define NRF_TEMP_S                        ((NRF_TEMP_Type*)                     NRF_TEMP_S_BASE)
#define NRF_P1_NS                         ((NRF_GPIO_Type*)                     NRF_P1_NS_BASE)
#define NRF_P1_S                          ((NRF_GPIO_Type*)                     NRF_P1_S_BASE)
#define NRF_GPIOTE20_NS                   ((NRF_GPIOTE_Type*)                   NRF_GPIOTE20_NS_BASE)
#define NRF_GPIOTE20_S                    ((NRF_GPIOTE_Type*)                   NRF_GPIOTE20_S_BASE)
#define NRF_GRTC_NS                       ((NRF_GRTC_Type*)                     NRF_GRTC_NS_BASE)
#define NRF_GRTC_S                        ((NRF_GRTC_Type*)                     NRF_GRTC_S_BASE)
#define NRF_TAMPC_S                       ((NRF_TAMPC_Type*)                    NRF_TAMPC_S_BASE)
#define NRF_SPU30_S                       ((NRF_SPU_Type*)                      NRF_SPU30_S_BASE)
#define NRF_DPPIC30_NS                    ((NRF_DPPIC_Type*)                    NRF_DPPIC30_NS_BASE)
#define NRF_DPPIC30_S                     ((NRF_DPPIC_Type*)                    NRF_DPPIC30_S_BASE)
#define NRF_PPIB30_NS                     ((NRF_PPIB_Type*)                     NRF_PPIB30_NS_BASE)
#define NRF_PPIB30_S                      ((NRF_PPIB_Type*)                     NRF_PPIB30_S_BASE)
#define NRF_SPIM30_NS                     ((NRF_SPIM_Type*)                     NRF_SPIM30_NS_BASE)
#define NRF_SPIS30_NS                     ((NRF_SPIS_Type*)                     NRF_SPIS30_NS_BASE)
#define NRF_TWIM30_NS                     ((NRF_TWIM_Type*)                     NRF_TWIM30_NS_BASE)
#define NRF_TWIS30_NS                     ((NRF_TWIS_Type*)                     NRF_TWIS30_NS_BASE)
#define NRF_UARTE30_NS                    ((NRF_UARTE_Type*)                    NRF_UARTE30_NS_BASE)
#define NRF_SPIM30_S                      ((NRF_SPIM_Type*)                     NRF_SPIM30_S_BASE)
#define NRF_SPIS30_S                      ((NRF_SPIS_Type*)                     NRF_SPIS30_S_BASE)
#define NRF_TWIM30_S                      ((NRF_TWIM_Type*)                     NRF_TWIM30_S_BASE)
#define NRF_TWIS30_S                      ((NRF_TWIS_Type*)                     NRF_TWIS30_S_BASE)
#define NRF_UARTE30_S                     ((NRF_UARTE_Type*)                    NRF_UARTE30_S_BASE)
#define NRF_COMP_NS                       ((NRF_COMP_Type*)                     NRF_COMP_NS_BASE)
#define NRF_LPCOMP_NS                     ((NRF_LPCOMP_Type*)                   NRF_LPCOMP_NS_BASE)
#define NRF_COMP_S                        ((NRF_COMP_Type*)                     NRF_COMP_S_BASE)
#define NRF_LPCOMP_S                      ((NRF_LPCOMP_Type*)                   NRF_LPCOMP_S_BASE)
#define NRF_WDT30_S                       ((NRF_WDT_Type*)                      NRF_WDT30_S_BASE)
#define NRF_WDT31_NS                      ((NRF_WDT_Type*)                      NRF_WDT31_NS_BASE)
#define NRF_WDT31_S                       ((NRF_WDT_Type*)                      NRF_WDT31_S_BASE)
#define NRF_P0_NS                         ((NRF_GPIO_Type*)                     NRF_P0_NS_BASE)
#define NRF_P0_S                          ((NRF_GPIO_Type*)                     NRF_P0_S_BASE)
#define NRF_GPIOTE30_NS                   ((NRF_GPIOTE_Type*)                   NRF_GPIOTE30_NS_BASE)
#define NRF_GPIOTE30_S                    ((NRF_GPIOTE_Type*)                   NRF_GPIOTE30_S_BASE)
#define NRF_CLOCK_NS                      ((NRF_CLOCK_Type*)                    NRF_CLOCK_NS_BASE)
#define NRF_POWER_NS                      ((NRF_POWER_Type*)                    NRF_POWER_NS_BASE)
#define NRF_RESET_NS                      ((NRF_RESET_Type*)                    NRF_RESET_NS_BASE)
#define NRF_CLOCK_S                       ((NRF_CLOCK_Type*)                    NRF_CLOCK_S_BASE)
#define NRF_POWER_S                       ((NRF_POWER_Type*)                    NRF_POWER_S_BASE)
#define NRF_RESET_S                       ((NRF_RESET_Type*)                    NRF_RESET_S_BASE)
#define NRF_OSCILLATORS_NS                ((NRF_OSCILLATORS_Type*)              NRF_OSCILLATORS_NS_BASE)
#define NRF_REGULATORS_NS                 ((NRF_REGULATORS_Type*)               NRF_REGULATORS_NS_BASE)
#define NRF_OSCILLATORS_S                 ((NRF_OSCILLATORS_Type*)              NRF_OSCILLATORS_S_BASE)
#define NRF_REGULATORS_S                  ((NRF_REGULATORS_Type*)               NRF_REGULATORS_S_BASE)

/* =========================================================================================================================== */
/* ================                                    TrustZone Remapping                                    ================ */
/* =========================================================================================================================== */

